workspace/event_alerts/app/controllers/chats_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "chats" ("body", "created_at", "event_id", "updated_at", "user_name") VALUES (?, ?, ?, ?, ?)  [["body", "hammer"], ["created_at", "2016-01-07 23:40:50.491303"], ["event_id", 3], ["updated_at", "2016-01-07 23:40:50.491303"], ["user_name", "nails"]]
---
	def create
		@event = Event.find(params[:event_id])
		@chat = @event.chats.create(chat_params)

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "chats".* FROM "chats"  WHERE "chats"."event_id" = ? AND "chats"."id" = ? LIMIT 1  [["event_id", 1], ["id", 1]]
DELETE FROM "chats" WHERE "chats"."id" = ?  [["id", 1]]
---
	def destroy
		@event = Event.find(params[:event_id])
		@chat = @event.chats.find(params[:id])
		@chat.destroy