workspace/event_alerts/app/controllers/precomments_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "precomments" ("body", "created_at", "event_id", "updated_at", "user_name") VALUES (?, ?, ?, ?, ?)  [["body", "are you cool"], ["created_at", "2016-01-09 01:26:19.549153"], ["event_id", 3], ["updated_at", "2016-01-09 01:26:19.549153"], ["user_name", "pmorana@gmail.com"]]
---
	def create
		@event = Event.find(params[:event_id])
		@precomment = @event.precomments.create(precomment_params)

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "precomments".* FROM "precomments"  WHERE "precomments"."event_id" = ? AND "precomments"."id" = ? LIMIT 1  [["event_id", 1], ["id", 1]]
DELETE FROM "precomments" WHERE "precomments"."id" = ?  [["id", 1]]
---
	def destroy
		@event = Event.find(params[:event_id])
		@precomment = @event.precomments.find(params[:id])
		@precomment.destroy